<?php

namespace Models;

use Controllers\ConectDB;

class DisciplineModel
{
    private $db;

    public function __construct()
    {
        $this->db = new ConectDB();
        $this->init();
    }

    public function init()
    {
        $query = 'CREATE TABLE IF NOT EXISTS discipline (
          id int(11) NOT NULL AUTO_INCREMENT,
          department_id int(11) NOT NULL,
          discipline_name VARCHAR (255) NOT NULL,
           PRIMARY KEY (`id`)
        ) ENGINE=MyISAM DEFAULT CHARSET=utf8;';

        $this->db->setQuery($query);
        $this->db->executeQuery();

        return $query;
    }

    public function addDemo()
    {
        $rows = $this->demoRows();
        $query = 'INSERT INTO discipline (department_id, discipline_name) VALUES '.PHP_EOL.implode(', '.PHP_EOL, $rows);
        $this->db->setQuery($query);
        $this->db->executeQuery();

        return $query;
    }

    public function demoRows()
    {
        $discipline_list_name = array(
        'Історія України', 'Культурологія', 'Українська мова (за професійним призначенням)', 'Іноземна мова (за професійним спрямуванням)',
        'Фізичне виховання', 'Фізика', 'Вища математика', 'Основи програмування та алгоритмічні мови', 'Безпека життєдіяльності',
        'Інженерна та  комп`ютерна графіка', 'Практика навчальна комп`ютерна', 'Структура та організація даних в ЕОМ',
        'Курсовий проект з основи програмування та алгоритмичних мов', 'Вступ до фаху', 'Філософія (філософія, реоігієзнавство, логіка, етика)',
        'Іноземна мова (за професійним спрямуванням)', 'Фізичне виховання', 'Фізика', 'Вища математика', 'Основи дискретної математики',
        'Теорія ймовірностей, ймовірнісні процеси і математична статистика', 'Об`єктно-орієнтоване програмування', 'Основи електротехніки та електроніки',
        'Комп`ютерна схемотехніка', 'Чисельні методи в інформатиці', 'Охорона праці', 'Практика навчальна комп`ютерна',
        'Мови асемблера', 'Вища математика (спец. глави)', 'Економічна теорія', 'Соціологія', 'Фізичне виховання', 'Системний аналіз та проектування',
        'Архітектура комп`ютерів', 'Технологія програмування', 'Організація баз даних', 'Практика виробнича', 'Теорія інформації',
        'Комп`ютерна графіка', 'Теорія операційних систем', 'КП з Організації баз даних та знань', 'Метрологія та стандартизація',
        'Сучасна теорія управління', 'Проектування ПЗ систем реального часу', 'Військова підготовка', 'Проектування ПЗ систем реального часу',
        'Політологія', 'Правознавство', 'Психологія', 'Основи екології', 'Методи та засоби комп. інформаційних технологій',
        'Комп`ютерні мережі (локальні, корпоративні, глобалні)', 'Моделювання систем', 'Системи штучного інтелекту', 'Економіка та організація виробництва',
        'Менеджмент', 'Системне програмування і операційні системи', 'Захист інформації в інформаційних управляючих системах',
        'Проектування та обслуговування локальних обчислювальних мереж', 'Орг. і функціон. інф.-обчис. комплексів та систем',
        'КП з Комп. мереж (локальні, корпоративні, глобальні)', 'Проектування і розробка інформаційних систем', 'Правове регулювання у сфері інформаційних технологій',
        'Мережні Java-технології', 'Правове регулювання у сфері інформаційних технологій', 'Цивільна оборона','Економіка галузі',
        'Охорона праці в галузі', 'Засоби мультимедія в нових інформац. технологіях', 'Програмування для Internet', 'Автоматизовані системи комп`ютеризованної обробки',
        'Менеджмент', 'Виробнича практика', 'Дипломування', 'Нейронні мережі', 'Інформаційна безпека в мережі Internet',
        'Інженерія програмного забезпечення', 'Професійні функції і задачі спеціаліста', 'Інтелектуальна власність', 'САПР програмного забезпечення',
        'Цифрова обробка сигналів', 'Геоінформаційні системи', 'Надійність функціонування інформаційних систем' );
        $query = "SELECT id FROM department WHERE 1";
        $this->db->setQuery($query);
        $department_temp_list = $this->db->getArrayList();
        $result = array();
        foreach ($discipline_list_name as $name ){
            $department = $department_temp_list[rand(0,count($department_temp_list))]['id'];
            $result[] = "(" . $department . ", '" . addslashes($name) . "')";
        }

        return $result;
    }
}